# encoding : utf-8

#===========================================================
# classResponder.rb
# Responderクラス
#  |--RegularResponderクラス
#  |--ReplyResponderクラス
#  |--MentionResponderクラス
#-----------------------------------------------------------
# Author : gembaf
# 2013/06/17
#===========================================================

#=================================================
# Responderクラス
#=================================================
class Responder
end

#=================================================
# RegularResponderクラス
#=================================================
class RegularResponder < Responder
end

#=================================================
# ReplyResponderクラス
#=================================================
class ReplyResponder < Responder
end

#=================================================
# MentionResponderクラス
#=================================================
class MentionResponder < Responder
end



